# Проверка отсутствия значения в списке
# В других случаях программа должна убедиться в том, что значение не входит
# в список. Для этого используется ключевое слово not

banned_users = ['andrew', 'caroline', 'david']
user = 'marie'

if user not in banned_users:
    print(f"Этого человека по имени {user.title()} нет в списке!!!")

# Если этого человека нет в списке то выводится сообщение


# Логическое выражение - это выражение результатом которого является True или False.
# Например, выражение 4 > 5 является логическим, так как его результатом является либо правда,
# либо ложь. Выражение 4 + 5 не является логическим, так как результатом его выполнения является число.


