#Проверка неравенства
# Если вы хотите проверить, что два значения различны, используйте комбинацию
# из восклицательного знака и знака равенства (!=)

reguested_topping = 'mushrooms'  # это переменная со значением

if reguested_topping != 'anchovies':  #если переменная не равна по значению с 'anchovies'
    print("Hold the anchovies!")   #то выводится это сообщение

# Строка 7 сравнивает значение requested_topping со значением 'anchovies'.
# Если эти два значения не равны, Python возвращает True и выполняет код после
# команды if. Если два значения равны, Python возвращает False и не выполняет
# код после команды if.
# Так как значение requested_topping отлично от 'anchovies', команда print будет
# выполнена:
# Hold the anchovies!
# В большинстве условных выражений, которые вы будете использовать в программах, будет проверяться равенство, но иногда проверка неравенства оказывается
# более эффективной.









